# Importando as Bibliotecas

In [4]:
# import pandas
import pandas as pd
import seaborn as sn

# Conhecendo os dados

#### Limpando a tabela

In [5]:
# importando a base de dados CSV
dados = pd.read_csv(filepath_or_buffer='data/spam.csv', sep=",", encoding="latin-1")

In [6]:
# apresentar os 5 primeiros nome da tabela. 
dados.head()

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [17]:
dados.describe()

       Rotulo                                           Mensagem
count    5169                                               5169
unique      2                                               5169
top       ham  Go until jurong point, crazy.. Available only ...
freq     4516                                                  1

In [7]:
# Analizando as informações da tabela
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [8]:
# Eliminando colunas vazias.
dados.drop(['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], axis=1 , inplace=True)

In [9]:
dados.head()

     v1                                                 v2
0   ham  Go until jurong point, crazy.. Available only ...
1   ham                      Ok lar... Joking wif u oni...
2  spam  Free entry in 2 a wkly comp to win FA Cup fina...
3   ham  U dun say so early hor... U c already then say...
4   ham  Nah I don't think he goes to usf, he lives aro...

In [10]:
# Verficar se existe dados duplicados
dados.duplicated().sum()

403

In [11]:
# Removendo dados duplicados
dados.drop_duplicates(inplace=True)
dados.duplicated().sum()

0

#### Conversão de nomes e tipos

In [12]:
#renomeando tabela
dados.rename({'v1':'Rotulo','v2':'Mensagem'}, axis=1, inplace=True)
dados.head()

  Rotulo                                           Mensagem
0    ham  Go until jurong point, crazy.. Available only ...
1    ham                      Ok lar... Joking wif u oni...
2   spam  Free entry in 2 a wkly comp to win FA Cup fina...
3    ham  U dun say so early hor... U c already then say...
4    ham  Nah I don't think he goes to usf, he lives aro...

In [13]:
dados.convert_dtypes(convert_string=True)

     Rotulo                                           Mensagem
0       ham  Go until jurong point, crazy.. Available only ...
1       ham                      Ok lar... Joking wif u oni...
2      spam  Free entry in 2 a wkly comp to win FA Cup fina...
3       ham  U dun say so early hor... U c already then say...
4       ham  Nah I don't think he goes to usf, he lives aro...
...     ...                                                ...
5567   spam  This is the 2nd time we have tried 2 contact u...
5568    ham              Will Ì_ b going to esplanade fr home?
5569    ham  Pity, * was in mood for that. So...any other s...
5570    ham  The guy did some bitching but I acted like i'd...
5571    ham                         Rofl. Its true to its name

[5169 rows x 2 columns]

#### Analisar os dados